In [1]:
import pandas as pd

# CSV

In [2]:
pd.read_csv("example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df=pd.read_csv("example")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df.to_csv("MY_output")

In [5]:
pd.read_csv("MY_output")                    # in this index has been formed as a new column

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [6]:
df.to_csv("MY_output",index=False)                 # we have to remove index to prevent that

In [7]:
pd.read_csv("MY_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Excel

In [8]:
df=pd.read_excel("Excel_Sample.xlsx")
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
df.to_excel("new_excel.xlsx")
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [18]:
data=pd.read_html("http://www.fdic.gov/bank/individual/failed/banklist.html")

In [20]:
type(data)

list

In [26]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

NOTE:for sql we have to use diffrent libraries based on which sql software we are using.

temporary way to read sql

In [51]:
from sqlalchemy import create_engine

In [52]:
engine= create_engine("sqlite:///:memory:")

In [53]:
df.to_sql("new_table",engine)

In [54]:
sqldf=pd.read_sql("new_table",con=engine)
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15